       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       AUTHOR. Luciano Holanda Porto
       DATE-WRITTEN. 03/08/2020
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.

       PROCEDURE DIVISION.
      *meu primeiro programa

       PROGRAM-BEGIN.
           DISPLAY "Hello World!".
           DISPLAY "Lug".

       PROGRAM-DONE.
           STOP RUN.
