       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG7.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY "QUEM OLHA PARA FORA SONHA E QUEM OLHA PARA DENTRO"
      -    " ACORDA. (CARL GUSTAV JUNG)".

       PROGRAM-DONE.
           STOP RUN.
