       IDENTIFICATION DIVISION.
      *    demonstrando constantes
       PROGRAM-ID. PROG2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "Hello World!".
           DISPLAY 55.
           DISPLAY 12.607.

       PROGRAM-DONE.
           STOP RUN.
