//&&&&&&&& JOB ,'T-REX',MSGCLASS=H,CLASS=A
//*
//*   JOB PARA EXECUÇÃO DE UM PROGRAMA
//*
//* SUBSTITUA &&&&&&&& NA LINHA 100 INDICANDO O NOME DO SEU JOB
//* SUBSTITUA %% NA LINHA 210 INDICANDO O NOME DO SEU ARQUIVO
//* SUBSTITUA ### NA LINHA 300 INDICANDO O NOME DO PROGRAMA
//*
//JOBLIB  DD  DSN=CAMINHO.%%,DISP=SHR
//*
//STEP1   EXEC  PGM=###
//SYSOUT  DD  SYSOUT=R,OUTLIM=1000